randread/150_node/job_1471010_fiojob_64/nid00094_fiojob_64/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 64 processes
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
[...]

test: (groupid=0, jobs=64): err= 0: pid=199359: Tue Jul 20 11:58:37 2021
  read: IOPS=315, BW=1261KiB/s (1291kB/s)(370MiB/300075msec)
    slat (usec): min=691, max=12544k, avg=202944.95, stdev=234322.21
    clat (usec): min=14, max=98172k, avg=47112507.00, stdev=19031936.32
     lat (msec): min=6, max=98340, avg=47315.46, stdev=19078.42
    clat percentiles (msec):
     |  1.00th=[  253],  5.00th=[ 3373], 10.00th=[14563], 20.00th=[17113],
     | 30.00th=[17113], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=  520, max=12224, per=100.00%, avg=1300.80, stdev=10.55, samples=30110
   iops        : min=  130, max= 3056, avg=325.20, stdev= 2.64, samples=30110
  lat (usec)   : 20=0.02%, 50=0.05%
  lat (msec)   : 10=0.01%, 20=0.03%, 50=0.12%, 100=0.19%, 250=0.57%
  lat (msec)   : 500=0.88%, 750=0.80%, 1000=0.57%, 2000=1.13%, >=2000=95.64%
  cpu          : usr=0.02%, sys=0.10%, ctx=95059, majf=0, minf=18910
  IO depths    : 1=0.1%, 2=0.1%, 4=0.3%, 8=0.5%, 16=1.1%, 32=2.2%, >=64=95.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=94596,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=1261KiB/s (1291kB/s), 1261KiB/s-1261KiB/s (1291kB/s-1291kB/s), io=370MiB (387MB), run=300075-300075msec